[
    {
        "courseId": "101",
        "title": "Blockchain Fundamentals",
        "category": "Blockchain & Web3",
        "description": "An introduction to blockchain technology, its principles, and applications in modern industries.",
        "summary": "This course covers the fundamentals of blockchain, including decentralized networks, smart contracts, and consensus mechanisms.",
        "duration": "6 weeks",
        "tests": 3,
        "modules": [
            {
                "moduleId": "M1",
                "title": "Introduction to Blockchain",
                "content": "Learn what blockchain is, how it works, and why it's revolutionary.",
                "learn": "Blockchain is a decentralized ledger that records transactions across multiple nodes. The key properties include decentralization, transparency, and immutability."
            },
            {
                "moduleId": "M2",
                "title": "Cryptography & Security",
                "content": "Understand hash functions, digital signatures, and cryptographic principles used in blockchain.",
                "learn": "Blockchain uses cryptographic techniques like SHA-256 hashing and elliptic curve digital signatures to ensure security and integrity."
            },
            {
                "moduleId": "M3",
                "title": "Consensus Mechanisms",
                "content": "Learn how blockchains achieve agreement without a central authority.",
                "learn": "Consensus mechanisms like Proof of Work (PoW) and Proof of Stake (PoS) ensure that all transactions are verified before being added to the blockchain."
            },
            {
                "moduleId": "M4",
                "title": "Smart Contracts & DApps",
                "content": "Explore Ethereum, Solidity, and the development of decentralized applications (DApps).",
                "learn": "Smart contracts are self-executing agreements stored on a blockchain. They eliminate intermediaries and automate processes."
            }
        ]
    },
    {
        "courseId": "102",
        "title": "Solidity for Smart Contracts",
        "category": "Blockchain & Web3",
        "description": "A hands-on course on Solidity programming to develop Ethereum smart contracts.",
        "summary": "Master Solidity, learn best practices, and build secure smart contracts.",
        "duration": "8 weeks",
        "tests": 4,
        "modules": [
            {
                "moduleId": "M1",
                "title": "Basics of Solidity",
                "content": "Learn about Solidity syntax, data types, and control structures.",
                "learn": "Solidity is a statically-typed programming language for writing smart contracts on Ethereum."
            },
            {
                "moduleId": "M2",
                "title": "Functions & Events",
                "content": "Understand Solidity functions, modifiers, and event logging.",
                "learn": "Functions define smart contract behavior, while events allow external applications to listen for changes on the blockchain."
            },
            {
                "moduleId": "M3",
                "title": "Smart Contract Security",
                "content": "Learn common security vulnerabilities and best practices.",
                "learn": "Reentrancy attacks, integer overflows, and improper access control are some of the security issues that developers must handle."
            },
            {
                "moduleId": "M4",
                "title": "Deploying Smart Contracts",
                "content": "Understand how to compile and deploy contracts using Remix and Hardhat.",
                "learn": "The contract must be compiled into bytecode and deployed using tools like Web3.js or Ethers.js."
            }
        ]
    },
    {
        "courseId": "103",
        "title": "EDU-Chain (Open Campus) Blockchain Development",
        "category": "Blockchain & Web3",
        "description": "Learn how to build blockchain-based education platforms using EDU-Chain (Open Campus).",
        "summary": "Explore decentralized education systems, tokenized learning, and on-chain certificate verification.",
        "duration": "6 weeks",
        "tests": 3,
        "modules": [
            {
                "moduleId": "M1",
                "title": "Decentralized Education on Blockchain",
                "content": "Understand how blockchain can revolutionize the education industry.",
                "learn": "EDU-Chain leverages blockchain to create an immutable ledger for academic credentials."
            },
            {
                "moduleId": "M2",
                "title": "Tokenized Learning",
                "content": "Learn how token incentives can enhance student engagement.",
                "learn": "By issuing tokens for completing courses, students are rewarded for learning efforts, enabling gamification of education."
            },
            {
                "moduleId": "M3",
                "title": "On-Chain Certification",
                "content": "Explore how blockchain can store academic records securely.",
                "learn": "Certificates are stored on the blockchain as tamper-proof records, making it easier for employers to verify credentials."
            },
            {
                "moduleId": "M4",
                "title": "Building DApps for Education",
                "content": "Learn to develop decentralized applications for education.",
                "learn": "DApps for education use smart contracts to automate tasks such as enrollment, grading, and credential verification."
            }
        ]
    },
    {
        "courseId": "104",
        "title": "Machine Learning for Beginners",
        "category": "AI & Data Science",
        "description": "Learn the fundamentals of Machine Learning, including supervised and unsupervised learning.",
        "summary": "This course introduces ML concepts like regression, classification, and neural networks.",
        "duration": "6 weeks",
        "tests": 3,
        "modules": [
            {
                "moduleId": "M1",
                "title": "Introduction to Machine Learning",
                "content": "Overview of ML concepts and real-world applications.",
                "learn": "Machine Learning enables computers to learn from data using algorithms such as supervised learning and unsupervised learning."
            },
            {
                "moduleId": "M2",
                "title": "Supervised Learning",
                "content": "Understand linear regression, decision trees, and support vector machines.",
                "learn": "Supervised learning uses labeled data to train models for classification and regression tasks."
            },
            {
                "moduleId": "M3",
                "title": "Unsupervised Learning",
                "content": "Explore clustering techniques and anomaly detection.",
                "learn": "Unsupervised learning finds hidden patterns in data using methods such as k-means clustering and hierarchical clustering."
            },
            {
                "moduleId": "M4",
                "title": "Neural Networks & Deep Learning",
                "content": "Learn about artificial neural networks and backpropagation.",
                "learn": "Deep learning models such as CNNs and RNNs are used for complex tasks like image recognition and natural language processing."
            }
        ]
    },
    {
        "courseId": "105",
        "title": "Cybersecurity & Ethical Hacking",
        "category": "Cybersecurity",
        "description": "Learn how to protect systems from cyber threats and become an ethical hacker.",
        "summary": "This course covers penetration testing, network security, and cryptography.",
        "duration": "8 weeks",
        "tests": 4,
        "modules": [
            {
                "moduleId": "M1",
                "title": "Penetration Testing Basics",
                "content": "Understand how ethical hacking is performed legally to secure systems.",
                "learn": "Penetration testing involves simulating cyber-attacks to identify vulnerabilities."
            },
            {
                "moduleId": "M2",
                "title": "Network Security",
                "content": "Learn how to secure networks against cyber threats.",
                "learn": "Firewalls, intrusion detection systems, and VPNs help prevent unauthorized access to networks."
            },
            {
                "moduleId": "M3",
                "title": "Malware Analysis",
                "content": "Understand different types of malware and how they spread.",
                "learn": "Viruses, worms, and ransomware are common forms of malware that exploit system vulnerabilities."
            },
            {
                "moduleId": "M4",
                "title": "Cryptography & Secure Communications",
                "content": "Learn how encryption keeps data safe.",
                "learn": "Cryptographic techniques like AES, RSA, and ECC ensure secure communication over the internet."
            }
        ]
    }
]